In [1]:
import numpy as np
import pandas as pd

In [56]:
arr=np.arange(0,16).reshape(4,4)
s=pd.DataFrame(arr)
s

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [57]:
col=[1,2,3,4]
row=['row 4','row 5','row 6','row 7']
arr1=np.arange(0,16).reshape(4,4)
s1=pd.DataFrame(arr,index=row,columns=col)
s1

        1   2   3   4
row 4   0   1   2   3
row 5   4   5   6   7
row 6   8   9  10  11
row 7  12  13  14  15

In [58]:
s1['Hello']=[3,4,5,6]

In [66]:
s1

        1   2   3   4  Hello
row 4   0   1   2   3      3
row 5   4   5   6   7      4
row 6   8   9  10  11      5
row 7  12  13  14  15      6

In [68]:
s1.drop('row 4', axis=0)
s1.drop('row 7', axis=0)

       1  2   3   4  Hello
row 4  0  1   2   3      3
row 5  4  5   6   7      4
row 6  8  9  10  11      5

In [99]:
s1.replace(4,'NaN')
s1

        1   2   3   4  Hello
row 4   0   1   2   3      3
row 5   4   5   6   7      4
row 6   8   9  10  11      5
row 7  12  13  14  15      6

In [100]:
s1.loc["row 4",:]

1        0
2        1
3        2
4        3
Hello    3
Name: row 4, dtype: int64

In [101]:
s1.loc["row 6",2]

9

In [106]:
s1.head(2)
print(s1.at['row 5',2])

5

In [114]:
df=pd.DataFrame({"Amit":[10,20,30],
                "Barsa":[40,50,60],
                "Chin":[11,12,33]},index=["test x","test y","test z"])
df

        Amit  Barsa  Chin
test x    10     40    11
test y    20     50    12
test z    30     60    33

In [117]:
#Display the students having greater than 30
#display the students having between 30 and 40
print(df[(df>=30)&(df<40)])

        Amit  Barsa  Chin
test x   NaN    NaN   NaN
test y   NaN    NaN   NaN
test z  30.0    NaN  33.0

In [118]:
print(df.sort_index(axis=0))

        Amit  Barsa  Chin
test x    10     40    11
test y    20     50    12
test z    30     60    33

In [119]:
print(df.sort_index(axis=1))

        Amit  Barsa  Chin
test x    10     40    11
test y    20     50    12
test z    30     60    33

In [126]:
df1=pd.DataFrame({"Amit":[1,2090132,1],
                "Barsa":[40,50,60],
                "Chin":[1,2,3]},index=["test x","test y","test z"])
df1

           Amit  Barsa  Chin
test x        1     40     1
test y  2090132     50     2
test z        1     60     3

In [127]:
print(df1.sort_index(axis=0))

           Amit  Barsa  Chin
test x        1     40     1
test y  2090132     50     2
test z        1     60     3

In [128]:
print(df1.sort_index(axis=1))

           Amit  Barsa  Chin
test x        1     40     1
test y  2090132     50     2
test z        1     60     3